InformationRegisters/доп_НабранныеНомера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>доп_НабранныеНомера</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/доп_ИсторияЗвонков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>доп_ИсторияЗвонков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗаписьРазговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СвойНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗвонка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.доп_ТипЗвонка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Успешность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьЛогин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДлительностьЗвонка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НабранныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/доп_ТипЗвонка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>доп_ТипЗвонка</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/доп_БитфонИзбранное.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>доп_БитфонИзбранное</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтслеживатьСтатус</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/доп_ТелефонияСервер/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Общий модуль телефонии ОЛИМП
// Содержит общие функции, вызываемые на сервере.
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьВерсиюПодсистемы() ЭКСПОРТ
	Возврат "1.7.37.456";
КонецФункции

Функция ЗаписатьОшибкуВЖурналРегистрации(стрИсточник, стрОшибка, стрОписание) ЭКСПОРТ
	ЗаписьЖурналаРегистрации(стрИсточник, УровеньЖурналаРегистрации.Ошибка, , стрОшибка, стрОписание);
КонецФункции

Функция ПолучитьТекущегоПользователя() ЭКСПОРТ
	//ПользовательБД = ИмяПользователя();
	//Пользователь = Справочники.Пользователи.НайтиПоКоду(ПользовательБД);
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	Возврат Пользователь;
КонецФункции

Процедура УстановитьНастройкуТекущегоПользователя(стрИмяРегистраСведений, стрИмяМодуля, стрНастройка, значениеНастройки) ЭКСПОРТ
	ПользовательЗап = ПолучитьТекущегоПользователя();
	зап = РегистрыСведений[стрИмяРегистраСведений].СоздатьМенеджерЗаписи();
	зап.Пользователь = ПользовательЗап;
	зап.Прочитать();
	обновитьЗапись = Ложь;
	Если НЕ зап.Выбран() Тогда
		ЗаполнитьНастройкиПоУмолчаниюОбщ(стрИмяМодуля, зап);
		обновитьЗапись = Истина;
	КонецЕсли;
	Если зап[стрНастройка] <> значениеНастройки Тогда
		зап[стрНастройка] = значениеНастройки;
		обновитьЗапись = Истина;
	КонецЕсли;
	Если обновитьЗапись Тогда
		зап.Записать();
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьПараметрыОткрытияФормыНастроек(стрИмяРегистраСведений, стрИмяМодуля) ЭКСПОРТ
	ПользовательЗап =  ПолучитьТекущегоПользователя();
	менеджЗапись = РегистрыСведений[стрИмяРегистраСведений].СоздатьМенеджерЗаписи();
	менеджЗапись.Пользователь = ПользовательЗап;
	менеджЗапись.Прочитать();
	Если НЕ менеджЗапись.Выбран() Тогда
		ЗаполнитьНастройкиПоУмолчаниюОбщ(стрИмяМодуля, менеджЗапись);
		менеджЗапись.Записать();
	КонецЕсли;
	Отбор = Новый Структура("Пользователь", ПользовательЗап);
	ключзап = РегистрыСведений[стрИмяРегистраСведений].СоздатьКлючЗаписи(Отбор);
	ПараметрыОткрытияНастроек = Новый Структура("Ключ", ключзап);
	Возврат ПараметрыОткрытияНастроек;
КонецФункции

// Возвращает массив из 3 чисел или Неопределено
Функция ПолучитьРежимСовместимостиКонфигурации() ЭКСПОРТ
	РежСовмест = Метаданные.РежимСовместимости;
	Если РежСовмест = Метаданные.СвойстваОбъектов.РежимСовместимости.НеИспользовать Тогда
		Возврат Неопределено;
	КонецЕсли;
	стрРежимСовмест = Строка(РежСовмест);
	стрРежимСовмест = СтрЗаменить(стрРежимСовмест, "Версия", "");
	списЗначРеж = доп_ТелефонияКлиентСервер.СтрРазбить(стрРежимСовмест, "_");
	массРеж = Новый Массив(3);
	Для й=0 По 2 Цикл
		массРеж[й] = Число(списЗначРеж[й].Значение);
	КонецЦикла;
	Возврат массРеж;
КонецФункции

Функция ПолучитьПрефиксВыходаНаВнешнююЛиниюПоУмолчанию() ЭКСПОРТ
	// префикс может переопределяться при внедрениях
	Возврат "";
КонецФункции

Функция ПолучитьНаименованиеНабранногоНомера(стрНабранныйНомер) ЭКСПОРТ
	стрНомерПоиска = доп_ТелефонияКлиентСервер.СократитьНомерДляПоиска(
							доп_ТелефонияКлиентСервер.ОчиститьНомерТолькоЦифры(стрНабранныйНомер)
							);
	стрНаименование = стрНомерПоиска;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	доп_НабранныеНомера.Наименование
	               |ИЗ
	               |	РегистрСведений.доп_НабранныеНомера КАК доп_НабранныеНомера
	               |ГДЕ
	               |	доп_НабранныеНомера.Номер = &Номер";
	Запрос.УстановитьПараметр("Номер", стрНомерПоиска);
	резт = Запрос.Выполнить();
	Если НЕ резт.Пустой() Тогда
		табл = резт.Выгрузить();
		наим = СокрЛП(табл[0].Наименование);
		Если ЗначениеЗаполнено(наим) Тогда
			стрНаименование = наим;
		КонецЕсли;
	КонецЕсли;
	Возврат стрНаименование;
КонецФункции

Функция СкачатьПоHTTPS(АдресHTTP, таймаут, флагЗагрузкаТекста, ТелоОтвета, стрОшибка) ЭКСПОРТ
	Возврат доп_ТелефонияКлиентСервер.СкачатьПоHTTPS(АдресHTTP, таймаут, флагЗагрузкаТекста, ТелоОтвета, стрОшибка);
КонецФункции

//-----------------------------------------------------------------------------
// Поиск контрагента и контактного лица по номеру телефона.
//
// Параметры:
//  НомерДляПоиска - Строка - номер телефона.
//  КонтрагентСсылка - ссылка на элемент справочника контрагентов (возвращаемый параметр).
//  КонтактноеЛицоСсылка - ссылка на элемент справочника контактных лиц (возвращаемый параметр).
//  флагНеИскатьКонтрагента - Булево - флаг, отключающий поиск в базе данных,
//                            параметры контрагент и контактное лицо заполняются пустыми ссылками.
//  флагПоискДублей - Булево - флаг, включающий поиск нескольких контрагентов.
//  флагЕстьДублиВозвращ - возвращаемое значение, тип Булево, признак того что найдены дубли контрагентов.
//
// Возвращаемое значение:
//   Булево - признак успешности поиска контрагента по номеру.
//
Функция НайтиКонтрагентаИКонтактноеЛицоПоНомеру(НомерДляПоиска, КонтрагентСсылка, КонтактноеЛицоСсылка, флагНеИскатьКонтрагента,
												флагПоискДублей, флагЕстьДублиВозвращ) ЭКСПОРТ
	КороткийНомер = доп_ТелефонияКлиентСервер.СократитьНомерДляПоиска(НомерДляПоиска);
	стрИмяСправочникаКонтрагентов = доп_ТелефонияСерверПереопределяемый.ПолучитьИмяСправочникаКонтрагентов();
	стрИмяСправочникаКонтактныхЛиц = доп_ТелефонияСерверПереопределяемый.ПолучитьИмяСправочникаКонтактныхЛиц();
	КонтрагентСсылка = Справочники[стрИмяСправочникаКонтрагентов].ПустаяСсылка();
	КонтактноеЛицоСсылка = Справочники[стрИмяСправочникаКонтактныхЛиц].ПустаяСсылка();
	флагЕстьДублиВозвращ = Ложь;
	Если НЕ ЗначениеЗаполнено(КороткийНомер) ИЛИ флагНеИскатьКонтрагента Тогда
		Возврат Ложь;
	КонецЕсли;
	найден = Ложь;
	
	//+Переопределенное
	//таблКонтраг = доп_ТелефонияСерверПереопределяемый.НайтиКонтрагентовПоНомеруВКонтактах(КороткийНомер, НЕ флагПоискДублей);
	таблКонтраг = доп_ТелефонияСерверПереопределяемый.НайтиКлиентовПоНомеруТелефона(КороткийНомер, флагПоискДублей);
	//-Переопределенное
	Если таблКонтраг.Количество() > 0 Тогда
		КонтрагентСсылка = таблКонтраг[0].Контрагент;
		КонтактноеЛицоСсылка = таблКонтраг[0].КонтактноеЛицо;
		найден = Истина;
		Если флагПоискДублей И таблКонтраг.Количество() > 1 Тогда
			Для Каждого строкаКонтраг Из таблКонтраг Цикл
				Если строкаКонтраг.Контрагент <> КонтрагентСсылка Тогда
					флагЕстьДублиВозвращ = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Возврат найден;
КонецФункции

// поиск в избранном
Функция НайтиКонтрагентаПоНомеруВИзбранном(Знач КороткийНомер, флагВнешнийВызов, КонтрагентСсылка) ЭКСПОРТ
	Если НЕ ЗначениеЗаполнено(КороткийНомер) Тогда
		КонтрагентСсылка = "";
		Возврат Ложь;
	КонецЕсли;
	
	запросИзбр = Новый Запрос;
	Если флагВнешнийВызов Тогда
		// внешний вызов
		длинаВнешнегоНомера = доп_ТелефонияКлиентСервер.ПолучитьДлинуВнешнегоНомера();
		внешНомер = Прав(КороткийНомер, длинаВнешнегоНомера);
		запросИзбр.Текст = "ВЫБРАТЬ
		|	доп_БитфонИзбранное.Наименование
		|ИЗ
		|	Справочник.доп_БитфонИзбранное КАК доп_БитфонИзбранное
		|ГДЕ
		|	(доп_БитфонИзбранное.Пользователь = &Пользователь
		|			ИЛИ доп_БитфонИзбранное.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))
		|	И доп_БитфонИзбранное.Номер ПОДОБНО &Номер";
		запросИзбр.УстановитьПараметр("Номер", "%" + внешНомер);
	Иначе
		запросИзбр.Текст = "ВЫБРАТЬ
		|	доп_БитфонИзбранное.Наименование
		|ИЗ
		|	Справочник.доп_БитфонИзбранное КАК доп_БитфонИзбранное
		|ГДЕ
		|	(доп_БитфонИзбранное.Пользователь = &Пользователь
		|			ИЛИ доп_БитфонИзбранное.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))
		|	И доп_БитфонИзбранное.Номер = &Номер";
		запросИзбр.УстановитьПараметр("Номер", КороткийНомер);
	КонецЕсли;
	
	запросИзбр.УстановитьПараметр("Пользователь", ПолучитьТекущегоПользователя());
	
	Результат = запросИзбр.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		КонтрагентСсылка = ВыборкаДетальныеЗаписи.Наименование + " (избранное)";
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Работа с историей звонков

Процедура ДобавитьВИсториюЗвонковСДатой(датаНачРазговора,
							СвойНомер,
							флагТипЗвонкаВходящий,
							Номер,
							Абонент,
							КонтактноеЛицо,
							Успешность,
							Длительность,
							НабранныйНомер,
							стрПутьКЗаписи) ЭКСПОРТ
	//
	запись = РегистрыСведений.доп_ИсторияЗвонков.СоздатьМенеджерЗаписи();
	запись.Пользователь			= ПолучитьТекущегоПользователя();
	запись.СвойНомер			= СвойНомер;
	запись.Дата					= датаНачРазговора;
	запись.Абонент				= Абонент;
	запись.КонтактноеЛицо		= КонтактноеЛицо;
	запись.Номер				= Номер;
	запись.ТипЗвонка = ? ( флагТипЗвонкаВходящий, Перечисления.доп_ТипЗвонка.Входящий, Перечисления.доп_ТипЗвонка.Исходящий);
	запись.Успешность			= Успешность;
	запись.ДлительностьЗвонка	= Длительность;
	запись.НабранныйНомер		= НабранныйНомер;
	запись.ЗаписьРазговора		= стрПутьКЗаписи;
	запись.Записать();
КонецПроцедуры

Процедура ДобавитьВИсториюЗвонков(СвойНомер,
							флагТипЗвонкаВходящий,
							Номер,
							Абонент,
							КонтактноеЛицо,
							Успешность,
							Длительность,
							НабранныйНомер,
							стрПутьКЗаписи) ЭКСПОРТ
	//
	датаНачРазговора = ТекущаяДата() - Длительность;
	//
	ДобавитьВИсториюЗвонковСДатой(датаНачРазговора,
		СвойНомер,
		флагТипЗвонкаВходящий,
		Номер,
		Абонент,
		КонтактноеЛицо,
		Успешность,
		Длительность,
		НабранныйНомер,
		стрПутьКЗаписи);
КонецПроцедуры

Функция ИсторияЗвонковПолучитьКлюч(структОтбор) ЭКСПОРТ
	структОтбор.Пользователь = ПолучитьТекущегоПользователя();
	ключ = РегистрыСведений.доп_ИсторияЗвонков.СоздатьКлючЗаписи(структОтбор);
	Возврат ключ;
КонецФункции

Функция УдалитьИсториюЗвонковКонтрагента(контрагентСсылка) ЭКСПОРТ
	Отбор = Новый Структура("Абонент", контрагентСсылка);
	выборка = РегистрыСведений.доп_ИсторияЗвонков.Выбрать(Отбор);
	записейУдалено = 0;
	Пока выборка.Следующий() Цикл
		менеджер = выборка.ПолучитьМенеджерЗаписи();
		менеджер.Удалить();
		записейУдалено = записейУдалено + 1;
	КонецЦикла;
	Возврат записейУдалено;
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Работа с Избранным

Процедура ИзбранноеУдалить(ИзбранноеСсылка) ЭКСПОРТ
	избрОбъект = ИзбранноеСсылка.ПолучитьОбъект();
	избрОбъект.ПометкаУдаления = Не избрОбъект.ПометкаУдаления;
	избрОбъект.Записать();
КонецПроцедуры

Процедура ИзбранноеОбновить(форма) ЭКСПОРТ
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	доп_БитфонИзбранное.Ссылка,
	               |	доп_БитфонИзбранное.Наименование,
	               |	доп_БитфонИзбранное.Номер,
	               |	доп_БитфонИзбранное.ОтслеживатьСтатус,
	               |	доп_БитфонИзбранное.ПометкаУдаления,
	               |	0 КАК ИндексКартинкиСтатуса
	               |ИЗ
	               |	Справочник.доп_БитфонИзбранное КАК доп_БитфонИзбранное
	               |ГДЕ
	               |	(доп_БитфонИзбранное.Пользователь = &Пользователь
	               |			ИЛИ доп_БитфонИзбранное.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	доп_БитфонИзбранное.Наименование";
	
	Пользователь = доп_ТелефонияСервер.ПолучитьТекущегоПользователя();
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	таблИзбр = Запрос.Выполнить().Выгрузить();
	форма.ЗначениеВРеквизитФормы(таблИзбр, "Избранное");
КонецПроцедуры

Функция ИзбранноеНайтиНомер(стрИзбранноеНаименование) ЭКСПОРТ
	стрИзбранноеНомер = "";
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	доп_БитфонИзбранное.Номер
	               |ИЗ
	               |	Справочник.доп_БитфонИзбранное КАК доп_БитфонИзбранное
	               |ГДЕ
	               |	доп_БитфонИзбранное.ПометкаУдаления = ЛОЖЬ
	               |	И доп_БитфонИзбранное.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование", стрИзбранноеНаименование);
	таблИзбр = Запрос.Выполнить().Выгрузить();
	Если таблИзбр.Количество() > 0 Тогда
		стрИзбранноеНомер = таблИзбр[0].Номер;
	КонецЕсли;
	Возврат стрИзбранноеНомер;
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Работа с библиотекой коннектора Сервера Лицензий 2.0

Функция ПолучитьПараметрСеансаПутьБиблиотекиКоннектораСЛ20(флагСофтфон) Экспорт
	стрПуть = "";
	Попытка
		Если флагСофтфон Тогда
			стрПуть = ПараметрыСеанса.доп_СЛ20_ПутьБиблиотекиКоннектораСофтфон;
		Иначе
			стрПуть = ПараметрыСеанса.доп_СЛ20_ПутьБиблиотекиКоннектораБИТАТС;
		КонецЕсли;
	Исключение
		// Исключение не обрабатывается
	КонецПопытки;
	Возврат стрПуть;
КонецФункции

Процедура УстановитьПараметрСеансаПутьБиблиотекиКоннектораСЛ20(флагСофтфон, стрПуть) Экспорт
	Если флагСофтфон Тогда
		ПараметрыСеанса.доп_СЛ20_ПутьБиблиотекиКоннектораСофтфон = стрПуть;
	Иначе
		ПараметрыСеанса.доп_СЛ20_ПутьБиблиотекиКоннектораБИТАТС = стрПуть;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьБиблиотекуКоннектораСЛ20(флагТипПлатформыВин64) Экспорт
	Если флагТипПлатформыВин64 Тогда
		Возврат ПолучитьОбщийМакет("доп_СЛ20БиблиотекаКоннектораWin64");
	Иначе
		Возврат ПолучитьОбщийМакет("доп_СЛ20БиблиотекаКоннектораWin32");
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНастройкиПоУмолчаниюОбщ(стрИмяМодуля, настройки)
	Если стрИмяМодуля = "доп_БитфонСервер" Тогда
		доп_БитфонСервер.ЗаполнитьНастройкиПоУмолчаниюТекущегоПользователя(настройки);
	ИначеЕсли стрИмяМодуля = "доп_АТССервер" Тогда
		доп_АТССервер.ЗаполнитьНастройкиПоУмолчаниюТекущегоПользователя(настройки);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
